----------------------------------------------------------------------------------------------------------------------------------------------------------
--緹卡
----------------------------------------------------------------------------------------------------------------------------------------------------------
Function LuaS_110427_0()

	LoadQuestOption( OwnerID() );	--讀取NPC模板
	if CheckAcceptQuest( OwnerID(),420379) ==true and checkflag( OwnerID(),540756) ==true then
		AddSpeakOption( OwnerID(), TargetID(), GetString("SO_110427_1") , "LuaSO_110427_1" ,0); 	--我想打聽妖精之筆。
		AddSpeakOption( OwnerID(), TargetID(), GetString("SO_RuneDancer_EXIT") , "LuaSO_110427_EXIT", 0 ); 		--結束對話
	end

End
----------------------------------------------------------------------------------------------------------------------------------------------------------
Function LuaSO_110427_1()

	SetSpeakDetail( OwnerID(), GetString("ST_110427") ); 	--線索內容，緹卡
	SetFlag( OwnerID(), 540753, 1);		--開啟旗標緹卡的線索
	AddSpeakOption( OwnerID(), TargetID( ), GetString("SO_RuneDancer_EXIT") , "LuaSO_110427_EXIT", 0 );		 --結束對話

End
----------------------------------------------------------------------------------------------------------------------------------------------------------
Function LuaSO_110427_EXIT()

	CloseSpeak( OwnerID() );	  --關閉對話視窗
end



----------------------------------------------------------------------------------------------------------------------------------------------------------
--培斯
----------------------------------------------------------------------------------------------------------------------------------------------------------
Function LuaS_110428_0()

	LoadQuestOption( OwnerID() );	--讀取NPC模板
	if CheckAcceptQuest( OwnerID(),420379) ==true and checkflag( OwnerID(),540753) ==true then	--有聆聽的試煉任務，與旗標緹卡的線索
		AddSpeakOption( OwnerID(), TargetID(), GetString("SO_110428_1") , "LuaSO_110428_1" ,0); 	--關於鵝毛筆。
		AddSpeakOption( OwnerID(), TargetID( ), GetString("SO_RuneDancer_EXIT") , "LuaSO_110428_EXIT", 0 );		 --結束對話
	end

End
----------------------------------------------------------------------------------------------------------------------------------------------------------
Function LuaSO_110428_1()

	SetSpeakDetail( OwnerID(), GetString("ST_110428") ); 		--線索內容，培斯
	SetFlag( OwnerID(), 540756, 0);		--關閉旗標月思的線索
	SetFlag( OwnerID(), 540754, 1);		--開啟旗標培斯的線索
	AddSpeakOption( OwnerID(), TargetID( ), GetString("SO_RuneDancer_EXIT") , "LuaSO_110428_EXIT", 0 );		 --結束對話

End
----------------------------------------------------------------------------------------------------------------------------------------------------------
Function LuaSO_110428_EXIT()

	CloseSpeak( OwnerID() );  	--關閉對話視窗
end



----------------------------------------------------------------------------------------------------------------------------------------------------------
--貝妲
----------------------------------------------------------------------------------------------------------------------------------------------------------
Function LuaS_110429_0()

	LoadQuestOption( OwnerID() );	--讀取NPC模板
	if CheckAcceptQuest( OwnerID(),420379) ==true and checkflag( OwnerID(),540754) ==true then	--有聆聽的試煉任務，與旗標培斯的線索
		AddSpeakOption( OwnerID(), TargetID(), GetString("SO_110429_1") , "LuaSO_110429_1" ,0); 	--關於天使的羽絨。
		AddSpeakOption( OwnerID(), TargetID( ), GetString("SO_RuneDancer_EXIT") , "LuaSO_110429_EXIT", 0 );		 --結束對話
	end

End
----------------------------------------------------------------------------------------------------------------------------------------------------------
Function LuaSO_110429_1()

	SetSpeakDetail( OwnerID(), GetString("ST_110429") ); 	--線索內容，貝妲
	SetFlag( OwnerID(), 540753, 0);		--關閉旗標緹卡的線索
	SetFlag( OwnerID(), 540755, 1);		--給予旗標貝妲的線索
	AddSpeakOption( OwnerID(), TargetID( ), GetString("SO_RuneDancer_EXIT") , "LuaSO_110429_EXIT", 0 );		 --結束對話

End
----------------------------------------------------------------------------------------------------------------------------------------------------------
Function LuaSO_110429_EXIT()

	CloseSpeak( OwnerID() ); 	 --關閉對話視窗
end



----------------------------------------------------------------------------------------------------------------------------------------------------------
--艾蜜兒
----------------------------------------------------------------------------------------------------------------------------------------------------------
Function LuaS_110430_0()

	LoadQuestOption( OwnerID() );	--讀取NPC模板
	if CheckAcceptQuest( OwnerID(),420379) ==true and checkflag( OwnerID(),540755) ==true then	--有聆聽的試煉任務，與旗標貝妲的線索
		AddSpeakOption( OwnerID(), TargetID(), GetString("SO_110430_1") , "LuaSO_110430_1" ,0);	 --我想找蒲公英。
		AddSpeakOption( OwnerID(), TargetID( ), GetString("SO_RuneDancer_EXIT") , "LuaSO_110430_EXIT", 0 ); 		--結束對話
	end

End
----------------------------------------------------------------------------------------------------------------------------------------------------------
Function LuaSO_110430_1()

	SetSpeakDetail( OwnerID(), GetString("ST_110430") ); 	--線索內容，艾蜜兒
	SetFlag( OwnerID(), 540754, 0);		--關閉旗標培斯的線索
	SetFlag( OwnerID(), 540755, 0);		--關閉旗標貝妲的線索
	Sleep(20);
	GiveBodyItem( OwnerID(), 200986, 1);   --給予妖精之筆
	AddSpeakOption( OwnerID(), TargetID( ), GetString("SO_RuneDancer_EXIT") , "LuaSO_110430_EXIT", 0 );		 --結束對話

End
----------------------------------------------------------------------------------------------------------------------------------------------------------
Function LuaSO_110430_EXIT()

	CloseSpeak( OwnerID() ); 	 --關閉對話視窗
end