-----------------------------------------------------------------------------------------------------------
--歐梅伊
-----------------------------------------------------------------------------------------------------------

function LuaS_110210()

	LoadQuestOption( OwnerID() );  --載入任務模板
	AddSpeakOption( OwnerID(), TargetID(), GetString("SO_110210_SICK"),   "LuaS_110210_Sick",    0 );	--增加一個選項，農場的疫病傳染

end

-----------------------------------------------------------------------------------------------------------

function LuaS_110210_Sick()

	SetSpeakDetail( OwnerID(), GetString("ST_110210_0"));
	AddSpeakOption( OwnerID(), TargetID(),  GetString("SO_LOOKOTHER"),     "LuaS_110210",      0 );	--增加一個選項，看看其他說明
--	AddSpeakOption( OwnerID(), TargetID(),  GetString("SO_EXIT"), "LuaS_110210_Exit",0 );		--增加一個選項，離開


end

-----------------------------------------------------------------------------------------------------------

function LuaS_110210_Exit()

	CloseSpeak( OwnerID() );	--關閉對話視窗

end

-----------------------------------------------------------------------------------------------------------