function LuaS_lol_LoadZone1Quest()
	local Zone1Quest = {}
	Zone1Quest[1] =  { 420700 , "前往報到"       , "新手導引者香奈兒(25,66)"             , "開墾隊隊長雷頓(27,70)"               }	-- 任務名稱: 前往報到
	Zone1Quest[2] =  { 420701 , "武器領取(戰士)"       , "開墾隊隊長雷頓(27,70)"               , "武器商人馬洛(26,68)"                 }	-- 任務名稱：武器領取(戰士)
	Zone1Quest[3] =  { 420702 , "武器領取(遊俠)"       , "開墾隊隊長雷頓(27,70)"               , "武器商人馬洛(26,68)"                 }	-- 任務名稱：武器領取(遊俠)
	Zone1Quest[4] =  { 420703 , "武器領取(盜賊)"       , "開墾隊隊長雷頓(27,70)"               , "武器商人馬洛(26,68)"                 }	-- 任務名稱：武器領取(盜賊)
	Zone1Quest[5] =  { 420704 , "武器領取(法師)"       , "開墾隊隊長雷頓(27,70)"               , "武器商人馬洛(26,68)"                 }	-- 任務名稱：武器領取(法師)
	Zone1Quest[6] =  { 420705 , "武器領取(祭司)"       , "開墾隊隊長雷頓(27,70)"               , "武器商人馬洛(26,68)"                 }	-- 任務名稱：武器領取(祭司)
	Zone1Quest[7] =  { 420706 , "武器領取(騎士)"       , "開墾隊隊長雷頓(27,70)"               , "武器商人馬洛(26,68)"                 }	-- 任務名稱：武器領取(騎士)
	Zone1Quest[8] =  { 420707 , "武器領取(言靈使)"       , "開墾隊隊長雷頓(27,70)"               , "武器商人馬洛(26,68)"                 }	-- 任務名稱：武器領取(言靈使)
	Zone1Quest[9] =  { 420708 , "武器領取(德魯伊)"       , "開墾隊隊長雷頓(27,70)"               , "武器商人馬洛(26,68)"                 }	-- 任務名稱：武器領取(德魯伊)
	Zone1Quest[10] = { 420711 , "初試身手"       , "武器商人馬洛(26,68)"                 , "開墾隊隊長雷頓(27,70)" , "五個蕈傘" }	-- 任務名稱：初試身手
	Zone1Quest[11] = { 420712 , "委託張貼"       , "開墾隊隊長雷頓(27,70)"               , "開墾聚落委託告示板(28,68)"           }	-- 任務名稱：委託張貼
	Zone1Quest[12] = { 420713 , "愛情困擾"       , "開墾聚落委託告示板(28,68)"           , "傳送師克利絲汀(28,69)"               }	-- 任務名稱：愛情困擾
	Zone1Quest[13] = { 420714 , "歸還禮物"       , "傳送師克利絲汀(28,69)"               , "藥水商人萊丁(27,70)"                 }	-- 任務名稱：歸還禮物
	Zone1Quest[14] = { 420715 , "柔軟藥水"       , "藥水商人萊丁(27,70)"                 , "開墾聚落住民莎嘉(28,70)"             }	-- 任務名稱：柔軟藥水
	Zone1Quest[15] = { 420716 , "冬衣縫製"       , "開墾聚落住民莎嘉(28,70)"             , "開墾聚落住民莎嘉(28,70)" , "十份幼狼胎毛" }	-- 任務名稱：冬衣縫製
	Zone1Quest[16] = { 420717 , "布衣修復"       , "開墾聚落住民莎嘉(28,70)"             , "防具商人山普(27,69)"                 }	-- 任務名稱：布衣修復
	Zone1Quest[17] = { 420718 , "穩定空間"       , "防具商人山普(27,69)"                 , "符文商人波特(27,71)"                 }	-- 任務名稱：穩定空間
	Zone1Quest[18] = { 420719 , "代送符文"       , "符文商人波特(27,71)"                 , "迷途之光傳教士耶魯保望．柘榴(30,70)" }	-- 任務名稱：代送符文
	Zone1Quest[19] = { 420720 , "緊急任務"       , "迷途之光傳教士耶魯保望．柘榴(30,70)" , "開墾隊隊長雷頓(27,70)"               }	-- 任務名稱：緊急任務
	Zone1Quest[20] = { 420721 , "物資補充(挖礦)"       , "開墾隊隊長雷頓(27,70)"               , "礦工指導員漢生(23,70)"               }	-- 任務名稱：物資補充(挖礦)
	Zone1Quest[21] = { 420722 , "物資補充(伐木)"       , "開墾隊隊長雷頓(27,70)"               , "樵夫指導員伍德(28,73)"               }	-- 任務名稱：物資補充(伐木)
	Zone1Quest[22] = { 420723 , "物資補充(採草)"       , "開墾隊隊長雷頓(27,70)"               , "採藥人指導員愛麗絲(26,72)"           }	-- 任務名稱：物資補充(採草)
	Zone1Quest[23] = { 420724 , "採集物資(挖礦)"       , "礦工指導員漢生(23,70)"               , "開墾隊隊長雷頓(27,70)" , "三份黃銅礦" }	-- 任務名稱：採集物資(挖礦)
	Zone1Quest[24] = { 420725 , "採集物資(伐木)"       , "樵夫指導員伍德(28,73)"               , "開墾隊隊長雷頓(27,70)" , "三份刺槐"  }	-- 任務名稱：採集物資(伐木)
	Zone1Quest[25] = { 420726 , "採集物資(採草)"       , "採藥人指導員愛麗絲(26,72)"           , "開墾隊隊長雷頓(27,70)" , "三份山魔楊草" }	-- 任務名稱：採集物資(採草)

	Zone1Quest[26] = { 420624 , "飲用湖水"       , "開墾聚落住民艾薇(29,69)"             , "開墾聚落住民艾薇(29,69)" , "白湖的湖水" }	-- 任務名稱：飲用湖水
	Zone1Quest[27] = { 420625 , "過濾碳石"       , "開墾聚落住民艾薇(29,69)"             , "開墾聚落住民艾薇(29,69)" , "礦坑深處的碳石" }	-- 任務名稱：過濾碳石
	Zone1Quest[28] = { 420468 , "協助傑爾的工作" , "開墾隊隊長雷頓(27,70)"               , "開墾隊副隊長傑爾(45,83,)"            }	-- 任務名稱: 協助傑爾的工作

	return Zone1Quest
end
