function Lua_FormationSystem()
	if	ReadRoleValue(OwnerID(),EM_RoleValue_OrgID) == 100052	then
		BeginPlot(OwnerID(),"LuaS_101782_0" , 0)
	end
end

function LuaS_100052_0()
	LuaDavis_custom_matrix(30,10,0,100052,0,0,0,0,0,100052,0)
end

--間距20之86_甲獸2人陣型------------------------------------------------
function LuaS_100052_2a()
	LuaDavis_custom_matrix(20,5,0,0,0,0,0,101601,0,101695,0)
end

--間距25之86_鬥獸2人陣型------------------------------------------------
function LuaS_100052_2b()
	LuaDavis_custom_matrix(25,5,0,0,0,0,101694,101600,0,0,0)
end

--間距10之28_屠屠2人陣型------------------------------------------------
function LuaS_100052_2c()
	LuaDavis_custom_matrix(10,5,0,101693,0,0,0,0,0,101693,0)
end

--間距10之28_屠畏2人陣型------------------------------------------------
function LuaS_100052_2d()
	LuaDavis_custom_matrix(10,5,0,101693,0,0,0,0,0,101692,0)
end

--間距15之56_踏殺2人陣型------------------------------------------------
function LuaS_100052_2e()
	LuaDavis_custom_matrix(15,5,0,0,0,0,101687,101688,0,0,0)
end

--間距15之59_屠畏2人陣型------------------------------------------------
function LuaS_100052_2f()
	LuaDavis_custom_matrix(14,5,0,0,0,0,101693,0,0,0,101692)
end

--間距15之56_屠畏2人陣型------------------------------------------------
function LuaS_100052_2g()
	LuaDavis_custom_matrix(15,5,0,0,0,0,101693,101692,0,0,0)
end

--間距15之359_甲獸獸3人陣型----------------------------------------------
function LuaS_100052_3a()
	LuaDavis_custom_matrix(15,5,0,0,101601,0,101695,0,101601,0,0)
end

--間距15之359_鬥獸獸3人陣型----------------------------------------------
function LuaS_100052_3b()
	LuaDavis_custom_matrix(15,5,0,0,101600,0,101694,0,101600,0,0)
end

--間距15之167_甲獸殺3人陣型----------------------------------------------
function LuaS_100052_3c()
	LuaDavis_custom_matrix(15,5,101695,0,0,0,0,101601,101688,0,0)
end

--間距15之167_鬥獸踏3人陣型----------------------------------------------
function LuaS_100052_3d()
	LuaDavis_custom_matrix(15,5,101694,0,0,0,0,101600,101687,0,0)
end

--間距15之359_兵屠畏3人陣型------------------------------------------------
function LuaS_100052_3e()
	LuaDavis_custom_matrix(15,5,0,0,101689,0,101693,0,0,0,101692)
end

--間距15之359_畏屠畏3人陣型------------------------------------------------
function LuaS_100052_3f()
	LuaDavis_custom_matrix(15,5,0,0,101692,0,101693,0,0,0,101692)
end


--間距15之1379_甲鬥獸獸4人陣型
function LuaS_100052_4a()
	LuaDavis_custom_matrix(15,5,101694,0,101600,0,0,0,101695,0,101601)
end

--間距7之1379_踏踏兵元4人陣型
function LuaS_100052_4b()
	LuaDavis_custom_matrix(7,5,101687,0,101691,0,0,0,101687,0,101689)
end

--間距8之1379_踏踏兵元4人陣型
function LuaS_100052_4c()
	LuaDavis_custom_matrix(8,5,101687,0,101691,0,0,0,101687,0,101689)
end

--間距10之1379_踏踏兵元4人陣型
function LuaS_100052_4d()
	LuaDavis_custom_matrix(10,5,101687,0,101691,0,0,0,101687,0,101689)
end

--間距7之1379_殺殺兵兵4人陣型
function LuaS_100052_4e()
	LuaDavis_custom_matrix(7,5,101688,0,101689,0,0,0,101688,0,101689)
end

--間距8之1379_殺殺兵兵4人陣型
function LuaS_100052_4f()
	LuaDavis_custom_matrix(8,5,101688,0,101689,0,0,0,101688,0,101689)
end

--間距10之1379_殺殺兵兵4人陣型
function LuaS_100052_4g()
	LuaDavis_custom_matrix(10,5,101688,0,101689,0,0,0,101688,0,101689)
end

--間距7之1379_踏殺畏兵4人陣型
function LuaS_100052_4h()
	LuaDavis_custom_matrix(7,5,101687,0,101688,0,0,0,101692,0,101689)
end

--間距8之1379_踏殺畏兵4人陣型
function LuaS_100052_4i()
	LuaDavis_custom_matrix(8,5,101687,0,101688,0,0,0,101692,0,101689)
end

--間距10之1379_踏殺畏兵4人陣型
function LuaS_100052_4j()
	LuaDavis_custom_matrix(10,5,101687,0,101688,0,0,0,101692,0,101689)
end

--間距15之13679_3水2舵五人陣型
function LuaS_100052_sp1()
	LuaDavis_custom_matrix(15,5,101256,0,101255,0,0,101255,101256,0,101255)
end

--間距15之12578_3水2舵五人陣型
function LuaS_100052_sp2()
	LuaDavis_custom_matrix(15,5,101256,101255,0,0,101255,0,101256,101255,0)
end

--間距15之359_甲獸獸3人陣型----------------------------------------------
function LuaS_100052_3k()
	LuaDavis_custom_matrix(50,5,0,0,0,0,101595,101596,0,0,0)
end