--節慶活動 2009年4月春雨節
--建立時間: 2009/03/23
--修改日期: 2009/04/06
--建立者  : 活動企劃 潘晉佳
-----------------------------------------------------------------------------------------------------
--112581 迷路的拉比兔
--隱形任務NPC 兔子物件以NPC為中心產出  
-----------------------------------------------------------------------------------------------------
function LuaN_112581_Parade() --兔
	local rabbit={}
	for i = 0,19 do  --20隻兔
		rabbit[i] = CreateObjByFlag(112581,780301, i ,1) --使用旗子產生兔子 npc 旗子編號 數量 
		AddToPartition( rabbit[i],0 )	--讓兔子產生
--		Say( rabbit[i] , i )
		SetRandMove(rabbit[i],60, 100, 15 )	--兔子亂數範圍內移動  (150=範圍, 100=10秒 , 20=每次移動距離)
	end
end
-----------------------------------------------------------------------------------------------------
function LuaN_1125rabbit()
	local LubbyRabbit = OwnerID()
	SetSpeakDetail(OwnerID(), "[SC_1125RABBIT02]" )--太好了～！你是來帶我回家的嗎？
end
-----------------------------------------------------------------------------------------------------
function LuaN_112504rabbit()
	SetSpeakDetail(OwnerID(), "[SC_112504RABBIT]" )--來，和我們一起熱鬧地慶祝春雨節吧～！
end
-----------------------------------------------------------------------------------------------------