
--間距20之86_甲獸2人陣型------------------------------------------------
function LuaS_100052_50_2a()
	LuaDavis_custom_matrix(20,5,0,0,0,0,0,101896,0,101906,0)
end

--間距25之86_鬥獸2人陣型------------------------------------------------
function LuaS_100052_50_2b()
	LuaDavis_custom_matrix(25,5,0,0,0,0,101905,101896,0,0,0)
end

--間距10之28_屠屠2人陣型------------------------------------------------
function LuaS_100052_50_2c()
	LuaDavis_custom_matrix(10,5,0,101904,0,0,0,0,0,101904,0)
end

--間距10之28_屠畏2人陣型------------------------------------------------
function LuaS_100052_50_2d()
	LuaDavis_custom_matrix(10,5,0,101904,0,0,0,0,0,101903,0)
end

--間距15之56_踏殺2人陣型------------------------------------------------
function LuaS_100052_50_2e()
	LuaDavis_custom_matrix(15,5,0,0,0,0,101898,101899,0,0,0)
end

--間距15之59_屠畏2人陣型------------------------------------------------
function LuaS_100052_50_2f()
	LuaDavis_custom_matrix(14,5,0,0,0,0,101904,0,0,0,101903)
end

--間距15之56_屠畏2人陣型------------------------------------------------
function LuaS_100052_50_2g()
	LuaDavis_custom_matrix(15,5,0,0,0,0,101904,101903,0,0,0)
end

--間距15之359_甲獸獸3人陣型----------------------------------------------
function LuaS_100052_50_3a()
	LuaDavis_custom_matrix(15,5,0,0,101896,0,101906,0,101896,0,0)
end

--間距15之359_鬥獸獸3人陣型----------------------------------------------
function LuaS_100052_50_3b()
	LuaDavis_custom_matrix(15,5,0,0,101896,0,101905,0,101896,0,0)
end

--間距15之167_甲獸殺3人陣型----------------------------------------------
function LuaS_100052_50_3c()
	LuaDavis_custom_matrix(15,5,101906,0,0,0,0,101896,101899,0,0)
end

--間距15之167_鬥獸踏3人陣型----------------------------------------------
function LuaS_100052_50_3d()
	LuaDavis_custom_matrix(15,5,101905,0,0,0,0,101896,101898,0,0)
end

--間距15之359_兵屠畏3人陣型------------------------------------------------
function LuaS_100052_50_3e()
	LuaDavis_custom_matrix(15,5,0,0,101900,0,101904,0,0,0,101903)
end

--間距15之359_畏屠畏3人陣型------------------------------------------------
function LuaS_100052_50_3f()
	LuaDavis_custom_matrix(15,5,0,0,101903,0,101904,0,0,0,101903)
end


--間距15之1379_甲鬥獸獸4人陣型
function LuaS_100052_50_4a()
	LuaDavis_custom_matrix(15,5,101905,0,101896,0,0,0,101906,0,101896)
end

--間距7之1379_踏踏兵元4人陣型
function LuaS_100052_50_4b()
	LuaDavis_custom_matrix(7,5,101898,0,101902,0,0,0,101898,0,101900)
end

--間距8之1379_踏踏兵元4人陣型
function LuaS_100052_50_4c()
	LuaDavis_custom_matrix(8,5,101898,0,101902,0,0,0,101898,0,101900)
end

--間距10之1379_踏踏兵元4人陣型
function LuaS_100052_50_4d()
	LuaDavis_custom_matrix(10,5,101898,0,101902,0,0,0,101898,0,101900)
end

--間距7之1379_殺殺兵兵4人陣型
function LuaS_100052_50_4e()
	LuaDavis_custom_matrix(7,5,101899,0,101900,0,0,0,101899,0,101900)
end

--間距8之1379_殺殺兵兵4人陣型
function LuaS_100052_50_4f()
	LuaDavis_custom_matrix(8,5,101899,0,101900,0,0,0,101899,0,101900)
end

--間距10之1379_殺殺兵兵4人陣型
function LuaS_100052_50_4g()
	LuaDavis_custom_matrix(10,5,101899,0,101900,0,0,0,101899,0,101900)
end

--間距7之1379_踏殺畏兵4人陣型
function LuaS_100052_50_4h()
	LuaDavis_custom_matrix(7,5,101898,0,101899,0,0,0,101903,0,101900)
end

--間距8之1379_踏殺畏兵4人陣型
function LuaS_100052_50_4i()
	LuaDavis_custom_matrix(8,5,101898,0,101899,0,0,0,101903,0,101900)
end

--間距10之1379_踏殺畏兵4人陣型
function LuaS_100052_50_4j()
	LuaDavis_custom_matrix(10,5,101898,0,101899,0,0,0,101903,0,101900)
end


--間距15之359_甲獸獸3人陣型----------------------------------------------
function LuaS_100052_50_3k()
	LuaDavis_custom_matrix(50,5,0,0,0,0,101595,101596,0,0,0)
end