function LuaS_113292()
	if CheckAcceptQuest( OwnerID() , 422458 ) == true or CheckAcceptQuest( OwnerID() , 422459 ) == true or CheckAcceptQuest( OwnerID() , 422460 ) == true or CheckAcceptQuest( OwnerID() , 422461 ) == true or CheckAcceptQuest( OwnerID() , 422462 ) or CheckAcceptQuest( OwnerID() , 422463 ) == true or CheckAcceptQuest( OwnerID() , 422864 ) or CheckAcceptQuest( OwnerID() , 422926 ) then
		LoadQuestOption( OwnerID() )  --載入任務模板
		for i = 1, 5 do
			local DrawCard_No = ReadRoleValue( TargetID() , EM_RoleValue_Register+i );
			if	DrawCard_No~=999999	then
				AddSpeakOption( OwnerID() , OwnerID() , "[SC_113292_02][$SETVAR1=["..DrawCard_No.."]]" , "LuaS_113292_CardExchange_"..i , 0 )	-- 我有你欠缺的[$VAR1]，我想跟你交換[205642]。
				DebugMsg( 0 , 0 , "Card_No = "..DrawCard_No )
			end
		end
	else
		SetSpeakDetail( OwnerID() , "[SC_113292_01]" )	-- 我喜歡怪物卡片！我正在收集怪物卡片！而且只要看到卡片圖鑑上還有問號，我就會非常的非常的受不了！！！
	end


end

function LuaS_113292_CardExchange_1()
	local DrawCard_No = ReadRoleValue( TargetID() , EM_RoleValue_Register+1 )
	--local CardName = GetObjNameByGUID(DrawCard_No)
	local CardName = "["..DrawCard_No.."]"

	if DelBodyItem( OwnerID() , DrawCard_No , 1 ) then
		SetSpeakDetail( OwnerID() , "[SC_113292_03][$SETVAR1="..CardName.."]" )	-- [$VAR1]！我的確還沒有這張卡片！那麼請收下你交換的[205642]。嘿嘿，我的卡片圖鑑上又新增了一張～
		GiveBodyItem( OwnerID() , 205642 , 1 )
	else
		SetSpeakDetail( OwnerID() , "[SC_113292_04][$SETVAR1="..CardName.."]" )	-- 呃...如果你只是單純記錯卡片名稱的話，我可以原諒你。否則請不要欺騙我的感情，你根本沒有[$VAR1]啊！
	end
end

function LuaS_113292_CardExchange_2()
	local DrawCard_No = ReadRoleValue( TargetID() , EM_RoleValue_Register+2 )
	local CardName = "["..DrawCard_No.."]"

	if DelBodyItem( OwnerID() , DrawCard_No , 1 ) then
		SetSpeakDetail( OwnerID() , "[SC_113292_03][$SETVAR1="..CardName.."]" )	-- [$VAR1]！我的確還沒有這張卡片！那麼請收下你交換的[205642]。嘿嘿，我的卡片圖鑑上又新增了一張～
		GiveBodyItem( OwnerID() , 205642 , 1 )
	else
		SetSpeakDetail( OwnerID() , "[SC_113292_04][$SETVAR1="..CardName.."]" )	-- 呃...如果你只是單純記錯卡片名稱的話，我可以原諒你。否則請不要欺騙我的感情，你根本沒有[$VAR1]啊！
	end
end

function LuaS_113292_CardExchange_3()
	local DrawCard_No = ReadRoleValue( TargetID() , EM_RoleValue_Register+3 )
	local CardName = "["..DrawCard_No.."]"

	if DelBodyItem( OwnerID() , DrawCard_No , 1 ) then
		SetSpeakDetail( OwnerID() , "[SC_113292_03][$SETVAR1="..CardName.."]" )	-- [$VAR1]！我的確還沒有這張卡片！那麼請收下你交換的[205642]。嘿嘿，我的卡片圖鑑上又新增了一張～
		GiveBodyItem( OwnerID() , 205642 , 1 )
	else
		SetSpeakDetail( OwnerID() , "[SC_113292_04][$SETVAR1="..CardName.."]" )	-- 呃...如果你只是單純記錯卡片名稱的話，我可以原諒你。否則請不要欺騙我的感情，你根本沒有[$VAR1]啊！
	end
end

function LuaS_113292_CardExchange_4()
	local DrawCard_No = ReadRoleValue( TargetID() , EM_RoleValue_Register+4 )
	local CardName = "["..DrawCard_No.."]"

	if DelBodyItem( OwnerID() , DrawCard_No , 1 ) then
		SetSpeakDetail( OwnerID() , "[SC_113292_03][$SETVAR1="..CardName.."]" )	-- [$VAR1]！我的確還沒有這張卡片！那麼請收下你交換的[205642]。嘿嘿，我的卡片圖鑑上又新增了一張～
		GiveBodyItem( OwnerID() , 205642 , 1 )
	else
		SetSpeakDetail( OwnerID() , "[SC_113292_04][$SETVAR1="..CardName.."]" )	-- 呃...如果你只是單純記錯卡片名稱的話，我可以原諒你。否則請不要欺騙我的感情，你根本沒有[$VAR1]啊！
	end
end

function LuaS_113292_CardExchange_5()
	local DrawCard_No = ReadRoleValue( TargetID() , EM_RoleValue_Register+5 )
	local CardName = "["..DrawCard_No.."]"

	if DelBodyItem( OwnerID() , DrawCard_No , 1 ) then
		SetSpeakDetail( OwnerID() , "[SC_113292_03][$SETVAR1="..CardName.."]" )	-- [$VAR1]！我的確還沒有這張卡片！那麼請收下你交換的[205642]。嘿嘿，我的卡片圖鑑上又新增了一張～
		GiveBodyItem( OwnerID() , 205642 , 1 )
	else
		SetSpeakDetail( OwnerID() , "[SC_113292_04][$SETVAR1="..CardName.."]" )	-- 呃...如果你只是單純記錯卡片名稱的話，我可以原諒你。否則請不要欺騙我的感情，你根本沒有[$VAR1]啊！
	end
end

function LuaS_113292_DrawCard()
	local card = {}

	card[1] = 770000      -- 蘑菇人卡片
	card[2] = 770001      -- 蘑菇人衛兵卡片
	card[3] = 770004      -- 幼狼卡片
	card[4] = 770005      -- 小熊卡片
	card[5] = 770006      -- 甲蟲卡片
	card[6] = 770007      -- 枯葉蝙蝠卡片
	card[7] = 770008      -- 野紋蛛卡片
	card[8] = 770009      -- 熊卡片
	card[9] = 770010      -- 山豬卡片
	card[10] = 770011      -- 狼卡片
	card[11] = 770013      -- 枯木魔蛛卡片
	card[12] = 770014      -- 黑暗蝙蝠卡片
	card[13] = 770015      -- 庫柏挖掘工卡片
	card[14] = 770016      -- 庫柏襲擊者卡片
	card[15] = 770018      -- 庫柏偵察兵卡片
	card[16] = 770019      -- 暗影蠑螈卡片
	card[17] = 770020      -- 蠑螈卡片
	card[18] = 770021      -- 穴蟹卡片
	card[19] = 770022      -- 紅鉗穴蟹卡片
	card[20] = 770023      -- 哥布林礦工卡片
	card[21] = 770024      -- 哥布林視察者卡片
	card[22] = 770025      -- 黑血商隊隊員卡片
	card[23] = 770026      -- 乳甲蟲卡片
	card[24] = 770027      -- 草原土狼卡片
	card[25] = 770028      -- 黑皮豬卡片
	card[26] = 770030      -- 庫柏突襲兵卡片
	card[27] = 770031      -- 突翅蜻蜓卡片
	card[28] = 770032      -- 噬血蝙蝠卡片
	card[29] = 770033      -- 盜賊卡片
	card[30] = 770034      -- 銀鬃獵犬卡片
	card[31] = 770035      -- 幽棘蜘蛛卡片
	card[32] = 770036      -- 鼠耳蝙蝠卡片
	card[33] = 770037      -- 腐食蜘蛛卡片
	card[34] = 770038      -- 執念虛影卡片
	card[35] = 770041      -- 麥督格惡農卡片
	card[36] = 770042      -- 麥督格惡僕卡片
	card[37] = 770044      -- 癩痢病豬卡片
	card[38] = 770045      -- 突變暴狼卡片
	card[39] = 770046      -- 塔格納徘徊者卡片
	card[40] = 770047      -- 塔格納遊蕩者卡片
	card[41] = 770052      -- 斑斕鶴鴕卡片
	card[42] = 770053      -- 銅殼甲蟲卡片
	card[43] = 770054      -- 鶴鴕幼禽卡片
	card[44] = 770055      -- 斜穀拾荒者卡片
	card[45] = 770056      -- 斜穀掠奪者卡片
	card[46] = 770057      -- 綠斑蘑菇人卡片
	card[47] = 770058      -- 尖脊穿山甲卡片
	card[48] = 770059      -- 硬刺穿山甲卡片
	card[49] = 770060      -- 鞭尾穿山甲卡片
	card[50] = 770061      -- 獠牙野豬卡片
	card[51] = 770062      -- 魔鬃野豬卡片
	card[52] = 770063      -- 犀利食人魚卡片
	card[53] = 770064      -- 犀利鰭斥魚卡片
	card[54] = 770065      -- 艾索蘭毛蛙卡片
	card[55] = 770068      -- 錘牙粗工卡片
	card[56] = 770069      -- 錘牙喧鬧者卡片
	card[57] = 770070      -- 錘牙操作員卡片
	card[58] = 770071      -- 錘牙惡棍卡片
	card[59] = 770072      -- 錘牙智者卡片
	card[60] = 770073      -- 錘牙衛兵卡片
	card[61] = 770075      -- 波普斯貪卡片
	card[62] = 770076      -- 犀利銳齒魚卡片
	card[63] = 770079      -- 靈修樹怪卡片
	card[64] = 770080      -- 蝕月樹怪卡片
	card[65] = 770081      -- 遊蕩樹怪卡片
	card[66] = 770082      -- 厚皮髦熊卡片
	card[67] = 770083      -- 利爪髦熊卡片
	card[68] = 770085      -- 刺葉妖藤花卡片
	card[69] = 770086      -- 嗜血妖藤花卡片
	card[70] = 770087      -- 虛影研究員卡片
	card[71] = 770088      -- 巨角馴鹿卡片
	card[72] = 770089      -- 傀儡法師卡片
	card[73] = 770090      -- 肉傀儡卡片
	card[74] = 770091      -- 邪妖卡片
	card[75] = 770094      -- 黏怪卡片
	card[76] = 770095      -- 黯夜音蝠卡片
	card[77] = 770099      -- 海波拉幼貂卡片
	card[78] = 770100      -- 霜谷獨眼巨人卡片
	card[79] = 999999      -- 拔忽卡片
	card[80] = 770102      -- 戰牛巡狩隊卡片
	card[81] = 770103      -- 長老馴鹿卡片
	card[82] = 770104      -- 野生拔忽卡片
	card[83] = 770106      -- 海波拉雪貂卡片
	card[84] = 770108      -- 海波拉寒蛛卡片
	card[85] = 770109      -- 火眼雪貂卡片
	card[86] = 770110      -- 海波拉雪蛙卡片
	card[87] = 770111      -- 厚鬃雪熊卡片
	card[88] = 770112      -- 海波拉冰蟹卡片
	card[89] = 770113      -- 黑鬃狐卡片
	card[90] = 770114      -- 寒夜冰精卡片
	card[91] = 770115      -- 寒夜冰妖卡片
	card[92] = 770116      -- 古代巨狼卡片
	card[93] = 770117      -- 高原妖草卡片
	card[94] = 770119      -- 石爪龍獸卡片
	card[95] = 770120      -- 尖嘯石像鬼卡片
	card[96] = 770121      -- 搗蛋石像鬼卡片
	card[97] = 770122      -- 冰藍蜥　卡片
	card[98] = 770123      -- 戰牛哨長卡片
	card[99] = 770124      -- 戰牛哨兵卡片
	card[100] = 770125      -- 戰牛祭司卡片
	card[101] = 770132      -- 追隨者卡片
	card[102] = 770133      -- 疾影卡片
	card[103] = 770135      -- 戰鬥盔甲卡片
	card[104] = 770136      -- 魔化法袍卡片
	card[105] = 770137      -- 悲慟結晶卡片
	card[106] = 770138      -- 憎恨結晶卡片
	card[107] = 770145      -- 驚懼結晶卡片
	card[108] = 770151      -- 食火夜妖卡片
	card[109] = 770152      -- 冰錐妖靈卡片
	card[110] = 770153      -- 魔源護蝠卡片
	card[111] = 770154      -- 銳鉗裂殼蠍卡片
	card[112] = 770156      -- 暗甲蟲卡片
	card[113] = 770162      -- 花花仙人掌卡片
	card[114] = 770163      -- 果果仙人掌卡片
	card[115] = 770164      -- 針針仙人掌卡片
	card[116] = 770165      -- 渾沌蜻蜓卡片
	card[117] = 770166      -- 黑體奔岩蠍卡片
	card[118] = 770167      -- 刺尾毒蠍卡片
	card[119] = 770168      -- 高原鬣蜥卡片
	card[120] = 770169      -- 閃鱗鬣蜥卡片
	card[121] = 770170      -- 風野獵手卡片
	card[122] = 770171      -- 風野巫醫卡片
	card[123] = 770172      -- 風野勇士卡片
	card[124] = 770173      -- 紅穀獵犬卡片
	card[125] = 770176      -- 風野訓獸師卡片
	card[126] = 770177      -- 風野鷹鬥士卡片
	card[127] = 770179      -- 峽谷熱岩蠍卡片
	card[128] = 770180      -- 熾熱蜥蜴卡片
	card[129] = 770183      -- 卡托拉克雄蟻卡片
	card[130] = 770184      -- 卡托拉克工蟻卡片
	card[131] = 770185      -- 卡托拉克兵蟻卡片
	card[132] = 770186      -- 卡托拉克王蟻卡片
	card[133] = 770187      -- 突變芽蟲卡片
	card[134] = 770190      -- 血肉乾枯男卡片
	card[135] = 770191      -- 靈魂乾涸女卡片
	card[136] = 770192      -- 耶達巫醫卡片
	card[137] = 770193      -- 烏鴉卡片
	card[138] = 770195      -- 巨鉗食礦蠍卡片
	card[139] = 770196      -- 晶礦蜥蜴卡片
	card[140] = 999999      -- 寶箱守護者卡片
	card[141] = 770198      -- 烈風羽妖卡片
	card[142] = 770199      -- 鐵爪羽妖卡片
	card[143] = 770200      -- 彩翼羽妖卡片
	card[144] = 770202      -- 誨暗大鳥卡片
	card[145] = 770203      -- 血肉乾枯女卡片
	card[146] = 770204      -- 靈魂乾涸男卡片
	card[147] = 770205      -- 癩痢犬卡片
	card[148] = 770206      -- 綠毛蠍卡片
	card[149] = 770208      -- 葉鼻蝙蝠卡片
	card[150] = 770209      -- 庫柏法師卡片
	card[151] = 770211      -- 符文雪精卡片
	card[152] = 770212      -- 噬血枯葉卡片
	card[153] = 770213      -- 深綠毒吻卡片
	card[154] = 770214      -- 突襲夜影卡片
	card[155] = 770215      -- 憂鬱魔源卡片
	card[156] = 770222      -- 克羅恩紅蠍卡片
	card[157] = 770227      -- 怨靈卡片
	card[158] = 770228      -- 庫柏突襲兵隊長卡片
	card[159] = 770229      -- 庫柏巫醫卡片
	card[160] = 770230      -- 基普奧卡片
	card[161] = 770231      -- 庫柏補給兵卡片
	card[162] = 770232      -- 旋風甲蟲卡片
	card[163] = 770236      -- 草原嚎狼卡片
	card[164] = 770237      -- 猛衝野豬卡片
	card[165] = 770238      -- 毒翅蜻蜓卡片
	card[166] = 770239      -- 斜穀邋遢者卡片
	card[167] = 770240      -- 斜穀惡臭者卡片
	card[168] = 770241      -- 堅脊穿山甲卡片
	card[169] = 770242      -- 銳剌穿山甲卡片
	card[170] = 770243      -- 鐵尾穿山甲卡片
	card[171] = 770244      -- 尖牙野豬卡片
	card[172] = 770245      -- 火鬃野豬卡片
	card[173] = 770246      -- 柴佐爾馴鹿卡片
	card[174] = 770247      -- 雪海獨眼巨人卡片
	card[175] = 770248      -- 雪海拔忽卡片
	card[176] = 770249      -- 黑體風行蠍卡片
	card[177] = 770250      -- 古代鬃蜥卡片
	card[178] = 770251      -- 畏光毒蠍卡片
	card[179] = 770252      -- 黑血商隊打手卡片
	card[180] = 770253      -- 地穴砂蟲卡片
	card[181] = 770254      -- 地底岩蠍卡片
	card[182] = 770255      -- 庫柏守護者卡片
	card[183] = 770256      -- 庫柏挖掘專家卡片
	card[184] = 770257      -- 庫柏智者卡片
	card[185] = 770258      -- 庫柏潛行者卡片
	card[186] = 770260      -- 恐懼化身卡片
	card[187] = 770261      -- 寒冰幻影卡片
	card[188] = 770262      -- 禁錮者之影卡片
	card[189] = 770263      -- 邪惡幻影卡片
	card[190] = 770264      -- 嗜血者之影卡片
	card[191] = 770265      -- 無頭戰士卡片
	card[192] = 770266      -- 不死搜尋者卡片
	card[193] = 770267      -- 盜寶者遺骸卡片
	card[194] = 770268      -- 黑暗核心守護者卡片
	card[195] = 770269      -- 狂風能源守護者卡片
	card[196] = 770270      -- 冰霜能源守護者卡片
	card[197] = 770271      -- 神聖符文祭司卡片
	card[198] = 770272      -- 火焰符文劍士卡片
	card[199] = 770273      -- 冰霜符文衛士卡片
	card[200] = 770274      -- 炙毒結晶體卡片
	card[201] = 770275      -- 劇毒結晶體卡片
	card[202] = 770277      -- 巨岩護衛者卡片
	card[203] = 770278      -- 寒鐵護衛者卡片
	card[204] = 770279      -- 瀆角護衛者卡片
	card[205] = 770280      -- 災厄降臨使者卡片
	card[206] = 770284      -- 屍骸護衛者卡片
	card[207] = 770285      -- 邪骨護衛者卡片
	card[208] = 770286      -- 歐蘇勒蠑螈卡片
	card[209] = 770287      -- 歐蘇勒毒蛙卡片
	card[210] = 770288      -- 美豔的謬思女侍卡片
	card[211] = 770289      -- 發狂的謬思女侍卡片
	card[212] = 770290      -- 悲慘的謬思女侍卡片
	card[213] = 770291      -- 符文警戒者卡片
	card[214] = 770292      -- 符文守衛者卡片
	card[215] = 770293      -- 符文毀滅者卡片
	card[216] = 770294      -- 符文巡邏者卡片
	card[217] = 770294      -- 符文護衛長卡片 改成 符文巡邏者卡片
	card[218] = 770302      -- 俄古力札勇士卡片
	card[219] = 770303      -- 俄古力札將軍卡片
	card[220] = 770304      -- 不屈的蠻兵卡片
	card[221] = 770305      -- 俄古力札鬥士卡片
	card[222] = 770306      -- 俄古力札攻城兵卡片
	card[223] = 770307      -- 俄古力札重擊者卡片
	card[224] = 770308      -- 俄古力札衝鋒者卡片
	card[225] = 770309      -- 俄古力札狼騎兵卡片
	card[226] = 770310      -- 狂暴巨狼卡片
	card[227] = 770311      -- 天火召喚者卡片
	card[228] = 770312      -- 俄古力札防禦者卡片
	card[229] = 770313      -- 俄古力札治療者卡片
	card[230] = 770313      -- 巨大的潛行者卡片 改成 俄古力札治療者卡片
	card[231] = 770328      -- 黑帆水手卡片
	card[232] = 770329      -- 黑帆舵手卡片
	card[233] = 770330      -- 黑帆嗜血者卡片
	card[234] = 770331      -- 雪波追隨者卡片
	card[235] = 770332      -- 黑帆破浪者卡片
	card[236] = 770333      -- 佈雷克秘使卡片
	card[237] = 770334      -- 黑帆猛擊者卡片
	card[238] = 770335      -- 佈雷克狙殺者卡片
	card[239] = 770336      -- 深海詛咒卡片
	card[240] = 770337      -- 深海夢魘卡片
	card[241] = 770338      -- 被詛咒的黑帆船員卡片
	card[242] = 770339      -- 被詛咒的黑帆海盜卡片
	card[243] = 770340      -- 沙漠幼狐卡片
	card[244] = 770342      -- 伊喀元氣鳥卡片
	card[245] = 770343      -- 苔胡巨犀卡片
	card[246] = 770344      -- 狂暴雄犀卡片
	card[247] = 770345      -- 符石守護劍士卡片
	card[248] = 770346      -- 好戰的遺跡劍士卡片
	card[249] = 770347      -- 符石守護衛士卡片
	card[250] = 770348      -- 好鬥的遺跡衛士卡片
	card[251] = 770349      -- 符石守護岩靈卡片
	card[252] = 770350      -- 巨大峽谷雀　卡片
	card[253] = 770351      -- 巨大青翼黑雕卡片
	card[254] = 770352      -- 巨大絕壁虹鷲卡片
	card[255] = 770353      -- 潛伏食草魚卡片
	card[256] = 770354      -- 閃鱗蠑螈卡片
	card[257] = 770355      -- 浮藻潮蟹卡片
	card[258] = 770356      -- 嗤牙獵犬卡片
	card[259] = 770357      -- 草原遊蕩者卡片
	card[260] = 770358      -- 草原掠奪者卡片
	card[261] = 770360      -- 霧都搜尋者卡片
	card[262] = 770361      -- 霧都狂妄者卡片
	card[263] = 770362      -- 霧都隱藏者卡片
	card[264] = 770364      -- 黑羊巡邏兵卡片
	card[265] = 770365      -- 黑羊衛士卡片
	card[266] = 770366      -- 黑羊斥侯卡片
	card[267] = 770367      -- 黑羊隊長卡片
	card[268] = 770368      -- 菁英黑羊守衛卡片
	card[269] = 770369      -- 奔流巨蟹卡片
	card[270] = 770370      -- 冠毛皮豬卡片
	card[271] = 770371      -- 兇猛食草魚卡片
	card[272] = 770372      -- 紫叱蜻蜓卡片
	card[273] = 770373      -- 赤羽鶴鴕卡片
	card[274] = 770374      -- 獨眼巨人工兵卡片
	card[275] = 770378      -- 石岩獸卡片
	card[276] = 770379      -- 獨眼巨人蠻兵卡片
	card[277] = 770380      -- 獨眼巨人軍官卡片
	card[278] = 770381      -- 荒野跳羚卡片
	card[279] = 770382      -- 狂奔蹬羚卡片
	card[280] = 770383      -- 荒野巨狼卡片
	card[281] = 770384      -- 荒野奔牛卡片
	card[282] = 770385      -- 峽谷雀　卡片
	card[283] = 770386      -- 青翼黑雕卡片
	card[284] = 770387      -- 絕壁虹鷲卡片
	card[285] = 770388      -- 伊喀藍羽鳥卡片
	card[286] = 770389      -- 邪氣葉球卡片
	card[287] = 770390      -- 黑暗棉蟲卡片
	card[288] = 770394      -- 庫柏采厥者卡片
	card[289] = 770395      -- 庫柏治傷者卡片
	card[290] = 770396      -- 庫柏巡路者卡片
	card[291] = 770397      -- 濕地毒蛙卡片
	card[292] = 770398      -- 瘀泥蠑螈卡片
	card[293] = 770399      -- 荒野食草魚卡片
	card[294] = 770400      -- 赤尾黑疣蛙卡片
	card[295] = 770401      -- 三線野豬卡片
	card[296] = 770402      -- 飄浮葉球卡片
	card[297] = 770403      -- 斑背蹬羚卡片
	card[298] = 770404      -- 跳跳草卡片
	card[299] = 770405      -- 幼年跳羚卡片
	card[300] = 770406      -- 巨角衝撞者卡片
	card[301] = 770407      -- 長角跳躍者卡片
	card[302] = 770409      -- 晶球種子卡片
	card[303] = 770410      -- 高地蜥蜴卡片
	card[304] = 770411      -- 重蹄馴鹿卡片
	card[305] = 770413      -- 冰原劍齒虎卡片
	card[306] = 999999      -- 冰原蜥蜴王卡片
	card[307] = 770415      -- 猛瑪撫育者卡片
	card[308] = 770416      -- 猛瑪幼獸卡片
	card[309] = 770417      -- 長角冰原猛瑪卡片
	card[310] = 770418      -- 兇暴冰原猛瑪卡片
	card[311] = 770420      -- 冰雪矮人士兵卡片
	card[312] = 770421      -- 冰雪矮人護衛隊長卡片
	card[313] = 770422      -- 冰雪矮人祭司卡片
	card[314] = 770423      -- 冰雪矮人角鬥士卡片
	card[315] = 770424      -- 冰雪矮人勞動者卡片
	card[316] = 999999     -- 冰雪矮人禁衛隊長卡片
	card[317] = 999999     -- 冰雪矮人挖掘者卡片
	card[318] = 770427      -- 冰原巨熊卡片
	card[319] = 770428      -- 極地巨熊卡片
	card[320] = 770429      -- 屍骸翼龍卡片
	card[321] = 770430      -- 冰封翼龍卡片
	card[322] = 770431      -- 寒怒翼龍卡片
	card[323] = 770432      -- 馴鹿卡片
	card[324] = 770433      -- 小雪狐卡片
	card[325] = 999999      -- 冰霜秘法巨人卡片
	card[326] = 770435      -- 龍牙山野豬卡片
	card[327] = 770436      -- 龍牙山郊狼卡片
	card[328] = 770437      -- 龍牙山灰熊卡片
	card[329] = 770441      -- 敏銳巨狼卡片
	card[330] = 770442      -- 戰鬥野豬卡片
	card[331] = 999999      -- 戰鬥巨狼卡片
	card[332] = 770444      -- 俄古力札看守者卡片
	card[333] = 770445      -- 俄古力札巡守者卡片
	card[334] = 770446      -- 俄古力札搜索者卡片
	card[335] = 770447      -- 俄古力札掮盾兵卡片
	card[336] = 770448      -- 俄古力札大廚卡片
	card[337] = 770449      -- 俄古力札重裝衛兵卡片
	card[338] = 770450      -- 俄古力札刃兵卡片
	card[339] = 770451      -- 俄古力札粗工卡片
	card[340] = 770455      -- 血甲卡片
	card[341] = 770459      -- 俄古力札巫醫卡片
	card[342] = 770460      -- 高地劍齒虎卡片
	card[343] = 770461      -- 龍牙冰獸卡片
	card[344] = 770462      -- 雜斑掠奪者卡片
	card[345] = 770463      -- 雜斑強盜卡片
	card[346] = 770464      -- 雜斑巡邏者卡片
	card[347] = 770465      -- 雜斑佔領者卡片
	card[348] = 770466      -- 雪爪屠戮者卡片
	card[349] = 770467      -- 雪爪巡查者卡片
	card[350] = 770468      -- 雪爪塗毒者卡片
	card[351] = 770469      -- 雪爪搜索者卡片
	card[352] = 770470      -- 雪爪長矛手卡片
	card[353] = 770471      -- 雪爪防禦者卡片
	card[354] = 770474      -- 雜斑弓手卡片
	card[355] = 770475      -- 雜斑槌兵卡片
	card[356] = 770476      -- 雜斑斧手卡片
	card[357] = 770477      -- 黑鬃守衛卡片
	card[358] = 770478      -- 黑鬃看守者卡片
	card[359] = 770479      -- 黑鬃巡兵卡片
	card[360] = 770481      -- 黑鬃射手卡片
	card[361] = 770482      -- 黑鬃俘人者卡片
	card[362] = 770483      -- 黑鬃突襲者卡片
	card[363] = 770485      -- 厚毛馴鹿卡片
	card[364] = 770486      -- 獵狼劍齒虎卡片
	card[365] = 770487      -- 白鬃巨狼卡片
	card[366] = 770489      -- 四翼禿鷹卡片
	card[367] = 770490      -- 枯妖魔草卡片
	card[368] = 770491      -- 黑翅掠鴉卡片
	card[369] = 770492      -- 荒原鬣狗卡片
	card[370] = 770493      -- 荒原飛翅卡片
	card[371] = 770494      -- 風元素卡片
	card[372] = 770495      -- 紅斑蟹卡片
	card[373] = 770496      -- 水手游魂卡片
	card[374] = 770497      -- 驚濤魚怪卡片
	card[375] = 770498      -- 裂濤魚怪卡片
	card[376] = 770499      -- 土甲蟹卡片
	card[377] = 770500      -- 雷鳴牛蛙卡片
	card[378] = 770501      -- 黑甲蟹卡片
	card[379] = 770503      -- 港口強盜卡片
	card[380] = 770504      -- 港口無賴卡片
	card[381] = 770505      -- 影月屠戮者卡片
	card[382] = 770506      -- 影月劫掠者卡片
	card[383] = 770507      -- 影月遊蕩者卡片
	card[384] = 770511      -- 絕地沙蠍卡片
	card[385] = 770512      -- 變異沙蠍卡片
	card[386] = 770513      -- 絕地蜥蜴卡片
	card[387] = 770515      -- 絕地沙蠍蛹卡片
	card[388] = 770516      -- 母沙蠍幼蟲卡片
	card[389] = 770517      -- 公沙蠍幼蟲卡片
	card[390] = 770518      -- 卵室守護者卡片
	card[391] = 770519      -- 淺灘龜人卡片
	card[392] = 770520      -- 淺灘護衛者卡片
	card[393] = 770521      -- 遊蕩黑帆水手卡片
	card[394] = 770522      -- 徘徊黑帆舵手卡片
	card[395] = 770523      -- 荒鎮居民亡魂卡片
	card[396] = 770524      -- 兇惡海盜亡魂卡片
	card[397] = 770525      -- 港口劫匪卡片
	card[398] = 770526      -- 港口扒手卡片
	card[399] = 770527      -- 港口遊民卡片
	card[400] = 770528      -- 俄古力札突擊兵卡片
	card[401] = 770529      -- 俄古力札突擊戰狼卡片
	card[402] = 770536      -- 水晶岩鼠卡片
	card[403] = 770537      -- 毛晶岩鼠卡片
	card[404] = 770538      -- 土元素巨人士兵卡片
	card[405] = 770539      -- 戰鬥佛格獸卡片
	card[406] = 770540      -- 戰甲佛格獸卡片
	card[407] = 770541      -- 冰雪踐踏者卡片
	card[408] = 770542      -- 冰雪殘殺者卡片
	card[409] = 770543      -- 冰雪殘兵卡片
	card[410] = 770544      -- 冰雪靈魂使卡片
	card[411] = 770545      -- 冰雪元素使卡片
	card[412] = 770546      -- 冰雪無畏者卡片
	card[413] = 770547      -- 冰雪屠戮者卡片
	card[414] = 770550      -- 冰雪矮人見習士兵卡片
	card[415] = 770551      -- 冰雪勞動者卡片
	card[416] = 770552      -- 冰雪搬運工卡片
	card[417] = 770553      -- 彩翼飛鷹卡片
	card[418] = 770554      -- 粉磷飛翅卡片
	card[419] = 770555      -- 綠胡爛泥獸卡片
	card[420] = 770556      -- 滾泥呼嚕獸卡片
	card[421] = 770557      -- 泥毛呼嚕獸卡片
	card[422] = 770558      -- 綠岩拉扣獸卡片
	card[423] = 770559      -- 黃塵爛泥獸卡片
	card[424] = 770560      -- 飛行雙毒針尾卡片
	card[425] = 770562      -- 兇惡水手卡片
	card[426] = 770563      -- 老練的海盜卡片
	card[427] = 770564      -- 輕巧女劍客卡片
	card[428] = 770565      -- 海盜雇工卡片
	card[429] = 770566      -- 狡滑雇工卡片
	card[430] = 770567      -- 安亞洛戰士卡片
	card[431] = 770568      -- 安亞洛祭司卡片
	card[432] = 770570      -- 安亞卡流亡者卡片
	card[433] = 770571      -- 安亞坦祭司卡片
	card[434] = 770572      -- 安亞坦居民卡片
	card[435] = 770574      -- 安亞坦獵手卡片
	card[436] = 770575      -- 安亞姆居民卡片
	card[437] = 770576      -- 安亞姆獵手卡片
	card[438] = 770577      -- 安亞姆祭司卡片
	card[439] = 770579      -- 魚嘴石蟹卡片
	card[440] = 770580      -- 鳴沙野生　卡片
	card[441] = 770581      -- 鳴沙馬蹄蟹卡片
	card[442] = 770582      -- 鳴沙拉扣獸卡片
	card[443] = 770583      -- 安亞卡倖存者卡片
	card[444] = 770585      -- 水元素卡片
	card[445] = 770586      -- 水之元素巨人卡片
	card[446] = 770587      -- 森林爪狐卡片
	card[447] = 770588      -- 枯枝毒蛛卡片
	card[448] = 770589      -- 森林花豹卡片
	card[449] = 770591      -- 遊蕩巨魔卡片 換成下一張
	card[450] = 770591      -- 斑紋鋸嘴獸卡片
	card[451] = 770592      -- 紅磷飛翅卡片
	card[452] = 770593      -- 硬鱗鋸嘴獸卡片
	card[453] = 770594      -- 邦加幼獸卡片
	card[454] = 770595      -- 邦加雌巨獸卡片
	card[455] = 770596      -- 邦加雄巨獸卡片
	card[456] = 770598      -- 沼澤巨狼卡片
	card[457] = 770599      -- 沼澤朽木卡片
	card[458] = 770600      -- 硬顱獵豹卡片
	card[459] = 770601      -- 硬顱獵手卡片
	card[460] = 770602      -- 硬顱戰士卡片
	card[461] = 770603      -- 硬顱薩滿卡片
	card[462] = 770605      -- 血牙奔狼卡片
	card[463] = 770606      -- 血牙獵手卡片
	card[464] = 770607      -- 血牙戰士卡片
	card[465] = 770608      -- 血牙薩滿卡片
	card[466] = 770610      -- 鮮紅毒蛛卡片
	card[467] = 770611      -- 妖蛇斥候卡片
	card[468] = 770612      -- 妖蛇勇士卡片
	card[469] = 770613      -- 妖蛇隊長卡片
	card[470] = 770617      -- 安亞卡畏縮者卡片
	card[471] = 770618      -- 血污焦油卡片
	card[472] = 770619      -- 赤紅蠑螈卡片
	card[473] = 770620      -- 安亞洛儀式祭司卡片
	card[474] = 770621      -- 安亞洛斥候卡片
	card[475] = 770622      -- 幼小蠑螈卡片
	card[476] = 770623      -- 暴食蝸牛卡片
	card[477] = 999999      -- 蜘蛛女神卡片
	card[478] = 770625      -- 長牙毒蛛卡片
	card[479] = 770626      -- 密林潛伏者卡片
	card[480] = 770627      -- 生病的樹人卡片
	card[481] = 770628      -- 彩翼飛翅卡片
	card[482] = 770629      -- 白毛穴兔卡片
	card[483] = 770630      -- 斑翅甲蟲卡片
	card[484] = 770631      -- 霞羽猛禽卡片
	card[485] = 770632      -- 活潑的樹人卡片
	card[486] = 770633      -- 健康的樹人卡片
	card[487] = 770634      -- 淺灘拉扣獸卡片
	card[488] = 770635      -- 平原狼卡片
	card[489] = 770636      -- 史波衛兵卡片
	card[490] = 770637      -- 史波法師卡片
	card[491] = 770638      -- 波拉達林卡片
	card[492] = 770639      -- 哨湖油蛙卡片
	card[493] = 770640      -- 哨湖蟹卡片
	card[494] = 770641      -- 虛弱的樹人卡片
	card[495] = 770642      -- 粉羽鶴鴕卡片
	card[496] = 770643      -- 丘陵幼熊卡片
	card[497] = 770645      -- 賽賓恩戰士卡片
	card[498] = 770646      -- 賽賓恩巫醫卡片
	card[499] = 770647      -- 掘穴鼠卡片

	-- 第一次出生的抽卡
	local CardSet = {}
	math.randomseed(math.random(10000, 99999))
	local CardSeed = math.random(1,499)
	for i = 1, 5 do
		CardSet[i] = math.fmod( CardSeed + math.random(1,100) , 500 )
		CardSeed = CardSet[i]
		if CardSet[i] ~= nil then
			local DrawCard_No = 770000
			if CardSet[i] ~= 0 then
				DrawCard_No = card[CardSet[i]]
			end
			WriteRoleValue( OwnerID() , EM_RoleValue_Register+i , DrawCard_No )	-- 寫進紀錄供對話選項用
			Say( OwnerID(), "[SC_113292_05][$SETVAR1=["..DrawCard_No.."]]" )	-- 嘖...原來我還欠缺[$VAR1]！
		end
	end
	while true do
		local min = GetSystime(2)	-- 現在電腦時間是幾分
		if min == 0 then
			local CardSet = {}
			math.randomseed(math.random(10000, 99999))
			local CardSeed = math.random(1,499)
			for i = 1, 5 do
				CardSet[i] = math.fmod( CardSeed + math.random(1,100) , 500 )
				CardSeed = CardSet[i]
				if CardSet[i] ~= nil then
					local DrawCard_No = 770000
					if CardSet[i] ~= 0 then
						DrawCard_No = card[CardSet[i]]
					end
					WriteRoleValue( OwnerID() , EM_RoleValue_Register+i , DrawCard_No )	-- 寫進紀錄供對話選項用
					Say( OwnerID(), "[SC_113292_05][$SETVAR1=["..DrawCard_No.."]]" )	-- 嘖...原來我還欠缺[$VAR1]！
				end
			end
		end
		--Say( OwnerID(), "Second = "..min )
		Sleep( 600 )
	end
end