------------------------------------------------------------------------------------------------------------------------------------------------
function Z22Recipe_Blacksmithing_01()--打鐵配方商人對話劇情
	LoadQuestOption( OwnerID())
	AddRecipe(TargetID(), -1)
	AddSpeakOption( OwnerID(), TargetID(), GetString("SC_Z22RECIPE_01"), "Z22_OpenRecipeList_Blacksmithing_01", 0 )--我要看你賣的普通級配方
	AddSpeakOption( OwnerID(), TargetID(), GetString("SC_Z22RECIPE_02"), "Z22_OpenRecipeList_Blacksmithing_02", 0 )--我要看你賣的優秀級配方
	AddSpeakOption( OwnerID(), TargetID(), GetString("SC_Z22RECIPE_03"), "Z22_OpenRecipeList_Blacksmithing_03", 0 )--我要看你賣的精良級配方
end

function Z22Recipe_ArmorCrafting_01()--製甲配方商人對話劇情
	LoadQuestOption( OwnerID())
	AddRecipe(TargetID(), -1)
	AddSpeakOption( OwnerID(), TargetID(), GetString("SC_Z22RECIPE_01"), "Z22_OpenRecipeList_ArmorCrafting_01", 0 )--我要看你賣的普通級配方
	AddSpeakOption( OwnerID(), TargetID(), GetString("SC_Z22RECIPE_02"), "Z22_OpenRecipeList_ArmorCrafting_02", 0 )--我要看你賣的優秀級配方
	AddSpeakOption( OwnerID(), TargetID(), GetString("SC_Z22RECIPE_03"), "Z22_OpenRecipeList_ArmorCrafting_03", 0 )--我要看你賣的精良級配方
end

function Z22Recipe_Tailoring_01()--裁縫配方商人對話劇情
	LoadQuestOption( OwnerID())
	AddRecipe(TargetID(), -1)
	AddSpeakOption( OwnerID(), TargetID(), GetString("SC_Z22RECIPE_01"), "Z22_OpenRecipeList_Tailoring_01", 0 )--我要看你賣的普通級配方
	AddSpeakOption( OwnerID(), TargetID(), GetString("SC_Z22RECIPE_02"), "Z22_OpenRecipeList_Tailoring_02", 0 )--我要看你賣的優秀級配方
	AddSpeakOption( OwnerID(), TargetID(), GetString("SC_Z22RECIPE_03"), "Z22_OpenRecipeList_Tailoring_03", 0 )--我要看你賣的精良級配方
end

function Z22Recipe_Carpentry_01()--木工配方商人對話劇情
	LoadQuestOption( OwnerID())
	AddRecipe(TargetID(), -1)
	AddSpeakOption( OwnerID(), TargetID(), GetString("SC_Z22RECIPE_01"), "Z22_OpenRecipeList_Carpentry_01", 0 )--我要看你賣的普通級配方
	AddSpeakOption( OwnerID(), TargetID(), GetString("SC_Z22RECIPE_02"), "Z22_OpenRecipeList_Carpentry_02", 0 )--我要看你賣的優秀級配方
	AddSpeakOption( OwnerID(), TargetID(), GetString("SC_Z22RECIPE_03"), "Z22_OpenRecipeList_Carpentry_03", 0 )--我要看你賣的精良級配方
end
------------------------------------------------------------------------------------------------------------------------------------------------
function Z22_OpenRecipeList_Blacksmithing_01()--開啟普通級打鐵配方販賣(白裝)
	CloseSpeak(OwnerID())--關閉對話視窗
	local Recipe={
			551590,--配方-簡易奧義專家鐵具箱	65
			551731,--配方-簡易精湛工藝鐵具箱	75
			551748,--配方-簡易完美專家鐵具箱	70
			551786,--配方-喀洛族之盾	66
			551787,--配方-爭執大劍	66
			551788,--配方-犯罪之劍	66
			551789,--配方-犯罪巨斧	66
			551790,--配方-爭執手斧	66
			551791,--配方-反叛重鎚	66
			551792,--配方-回歸之鎚	66
			551793,--配方-兇惡匕首	66
			551925,--配方-生死大盾	71
			551926,--配方-生死大劍	71
			551927,--配方-補給之劍	71
			551928,--配方-補給巨斧	71
			551929,--配方-生死手斧	71
			551930,--配方-聖所重鎚	71
			551931,--配方-神使之鎚	71
			551932,--配方-神使匕首	71
			552114,--配方-風岩大盾	76
			552117,--配方-屠戮大劍	76
			552118,--配方-傳奇之劍	76
			552119,--配方-綠痕刃斧	76
			552120,--配方-死誓戰斧	76
			552121,--配方-痛擊大鎚	76
			552122,--配方-刺骨之鎚	76
			552124,--配方-波紋之匕	76
			552180 ,	--配方-聖十字劍78
			552181 ,	--配方-金朵重斧78
			552182 ,	--配方-顱骨大鎚78
			552184		--配方-銅刺匕首78
				}
	for i = 1 ,table.getn(Recipe) ,1 do
		AddRecipe( TargetID(), Recipe[i] )
	end
	GetRecipeList(OwnerID(),TargetID())--開啟配方販賣
end

function Z22_OpenRecipeList_Blacksmithing_02()--開啟優秀級打鐵配方販賣
	CloseSpeak(OwnerID())--關閉對話視窗
	local Recipe={
			551591,--配方-實用奧義專家鐵具箱	65
			551732,--配方-實用精湛工藝鐵具箱	75
			551749,--配方-實用完美專家鐵具箱	70
			551812,--配方-強化喀洛族之盾	66
			551813,--配方-強化爭執大劍	66
			551814,--配方-強化犯罪之劍	66
			551815,--配方-強化犯罪巨斧	66
			551816,--配方-強化爭執手斧	66
			551817,--配方-強化反叛重鎚	66
			551818,--配方-強化回歸之鎚	66
			551819,--配方-強化兇惡匕首	66
			551951,--配方-強化生死大盾	71
			551952,--配方-強化生死大劍	71
			551953,--配方-強化補給之劍	71
			551954,--配方-強化補給巨斧	71
			551955,--配方-強化生死手斧	71
			551956,--配方-強化聖所重鎚	71
			551957,--配方-強化神使之鎚	71
			551958,--配方-強化神使匕首	71
			552140,--配方-強化風岩大盾	76
			552143,--配方-強化屠戮大劍	76
			552144,--配方-強化傳奇之劍	76
			552145,--配方-強化綠痕刃斧	76
			552146,--配方-強化死誓戰斧	76
			552147,--配方-強化痛擊大鎚	76
			552148,--配方-強化刺骨之鎚	76
			552150,--配方-強化波紋之匕	76
			552203,--配方-強化聖十字劍78
			552204,--配方-強化金朵重斧79
			552205,--配方-強化顱骨大鎚78
			552207--配方-強化銅刺匕首79
			}
	for i = 1 ,table.getn(Recipe) ,1 do
		AddRecipe( TargetID(), Recipe[i] )
	end
	GetRecipeList(OwnerID(),TargetID())--開啟配方販賣
end

function Z22_OpenRecipeList_Blacksmithing_03()--開啟精良級打鐵配方販賣
	CloseSpeak(OwnerID())--關閉對話視窗
	local Recipe={
			551592,--配方-精緻奧義專家鐵具箱	65
			551733,--配方-精緻精湛工藝鐵具箱	75
			551750,--配方-精緻完美專家鐵具箱	70
			551838,--配方-稀有喀洛族之盾	66
			551839,--配方-稀有爭執大劍	66
			551840,--配方-稀有犯罪之劍	66
			551841,--配方-稀有犯罪巨斧	66
			551842,--配方-稀有爭執手斧	66
			551843,--配方-稀有反叛重鎚	66
			551844,--配方-稀有回歸之鎚	66
			551845,--配方-稀有兇惡匕首	66
			551992,--配方-稀有生死大盾	71
			551993,--配方-稀有生死大劍	71
			551994,--配方-稀有補給之劍	71
			551995,--配方-稀有補給巨斧	71
			551996,--配方-稀有生死手斧	71
			551997,--配方-稀有聖所重鎚	71
			551998,--配方-稀有神使之鎚	71
			551999,--配方-稀有神使匕首	71
			552166,--配方-稀有風岩大盾	76
			552169,--配方-稀有屠戮大劍	76
			552170,--配方-稀有傳奇之劍	76
			552171,--配方-稀有綠痕刃斧	76
			552172,--配方-稀有死誓戰斧	76
			552173,--配方-稀有痛擊大鎚	76
			552174,--配方-稀有刺骨之鎚	76
			552176,--配方-稀有波紋之匕	76
			552226 ,--	配方-稀有聖十字劍	打鐵	79
			552227 ,--	配方-稀有金朵重斧	打鐵	80
			552228 ,--	配方-稀有顱骨大鎚	打鐵	79
			552230 ,--	配方-稀有銅刺匕首	打鐵	80
			552289 --	配方-奧義鐵具箱	打鐵	80
				}
	for i = 1 ,table.getn(Recipe) ,1 do
		AddRecipe( TargetID(), Recipe[i] )
	end
	GetRecipeList(OwnerID(),TargetID())--開啟配方販賣
end
------------------------------------------------------------------------------------------------------------------------------------------------
function Z22_OpenRecipeList_ArmorCrafting_01()--開啟普通級製甲配方販賣
	CloseSpeak(OwnerID())--關閉對話視窗
	local Recipe={	
			551220,--配方-簡易奧義專家製甲箱	65
			551754,--配方-簡易完美專家製甲箱	70
			551772,--配方-簡易精湛工藝製甲箱	75
			551773,--配方-丘陵鎧盔	66
			551774,--配方-丘陵鎧甲	66
			551775,--配方-丘陵護腿	66
			551776,--配方-喀洛族頭盔	66
			551777,--配方-喀洛族戰甲	66
			551778,--配方-喀洛族褲子	66
			551779,--配方-礦坑皮帽	66
			551780,--配方-礦坑皮衣	66
			551781,--配方-礦坑皮褲	66
			551912,--配方-生死鎧盔	71
			551913,--配方-生死鎧甲	71
			551914,--配方-生死護腿	71
			551915,--配方-補給頭盔	71
			551916,--配方-補給戰甲	71
			551917,--配方-補給褲子	71
			551918,--配方-神使皮帽	71
			551919,--配方-神使皮衣	71
			551920,--配方-神使皮褲	71
			552102,--配方-永凍頭盔	76
			552103,--配方-永凍鎧甲	76
			552104,--配方-永凍護腿	76
			552105,--配方-夜暮護盔	76
			552106,--配方-夜幕輕甲	76
			552107,--配方-夜幕腿甲	76
			552108,--配方-低喃面甲	76
			552109,--配方-低喃皮甲	76
			552110,--配方-低喃護腿	76
			552187,--配方-黃金鎧甲鎧手	製甲	78
			552188,--配方-黃金鎧甲鎧褲	製甲	78
			552189,--配方-黃金鎧甲腰帶	製甲	78
			552191,--配方-赤紅鎖穗手套	製甲	78
			552192,--配方-赤紅鎖穗之褲	製甲	78
			552193,--配方-赤紅鎖穗腰帶	製甲	78
			552195,--配方-叢林探索手套	製甲	78
			552196,--配方-叢林探索長褲	製甲	78
			552197--配方-叢林探索腰帶	製甲	78
				}
	for i = 1 ,table.getn(Recipe) ,1 do
		AddRecipe( TargetID(), Recipe[i] )
	end
	GetRecipeList(OwnerID(),TargetID())--開啟配方販賣
end

function Z22_OpenRecipeList_ArmorCrafting_02()--開啟優秀級製甲配方販賣
	CloseSpeak(OwnerID())--關閉對話視窗
	local Recipe={
			551221,--配方-實用奧義專家製甲箱	65
			551755,--配方-實用完美專家製甲箱	70
			551799,--配方-強化丘陵鎧盔	66
			551800,--配方-強化丘陵鎧甲	66
			551801,--配方-強化丘陵護腿	66
			551802,--配方-強化喀洛族頭盔	66
			551803,--配方-強化喀洛族戰甲	66
			551804,--配方-強化喀洛族褲子	66
			551805,--配方-強化礦坑皮帽	66
			551806,--配方-強化礦坑皮衣	66
			551807,--配方-強化礦坑皮褲	66
			551880,--配方-實用精湛工藝製甲箱	75
			551938,--配方-強化生死鎧盔	71
			551939,--配方-強化生死鎧甲	71
			551940,--配方-強化生死護腿	71
			551941,--配方-強化補給頭盔	71
			551942,--配方-強化補給戰甲	71
			551943,--配方-強化補給褲子	71
			551944,--配方-強化神使皮帽	71
			551945,--配方-強化神使皮衣	71
			551946,--配方-強化神使皮褲	71
		 	552128,--配方-強化永凍頭盔	76
		 	552129,--配方-強化永凍鎧甲	76
		 	552130,--配方-強化永凍護腿	76
		 	552131,--配方-強化夜暮護盔	76
		 	552132,--配方-強化夜幕輕甲	76
		 	552133,--配方-強化夜幕腿甲	76
		 	552134,--配方-強化低喃面甲	76
		 	552135,--配方-強化低喃皮甲	76
		 	552136,--配方-強化低喃護腿	76
			552210 ,--	配方-強化黃金鎧甲鎧手	製甲	78
			552211 ,--	配方-強化黃金鎧甲鎧褲	製甲	79
			552212 ,--	配方-強化黃金鎧甲腰帶	製甲	78
			552214 ,--	配方-強化赤紅鎖穗手套	製甲	78
			552215 ,--	配方-強化赤紅鎖穗之褲	製甲	79
			552216 ,--	配方-強化赤紅鎖穗腰帶	製甲	78
			552218 ,--	配方-強化叢林探索手套	製甲	78
			552219 ,--	配方-強化叢林探索長褲	製甲	79
			552220 --	配方-強化叢林探索腰帶	製甲	78
				}
	for i = 1 ,table.getn(Recipe) ,1 do
		AddRecipe( TargetID(), Recipe[i] )
	end
	GetRecipeList(OwnerID(),TargetID())--開啟配方販賣
end

function Z22_OpenRecipeList_ArmorCrafting_03()--開啟精良級製甲配方販賣
	CloseSpeak(OwnerID())--關閉對話視窗
	local Recipe={	
			551222,--配方-精緻奧義專家製甲箱	65
			551756,--配方-精緻完美專家製甲箱	70
			551825,--配方-稀有丘陵鎧盔	66
			551826,--配方-稀有丘陵鎧甲	66
			551827,--配方-稀有丘陵護腿	66
			551828,--配方-稀有喀洛族頭盔	66
			551829,--配方-稀有喀洛族戰甲	66
			551830,--配方-稀有喀洛族褲子	66
			551831,--配方-稀有礦坑皮帽	66
			551832,--配方-稀有礦坑皮衣	66
			551833,--配方-稀有礦坑皮褲	66
			551881,--配方-精緻精湛工藝製甲箱	75
			551979,--配方-稀有生死鎧盔	71
			551980,--配方-稀有生死鎧甲	71
			551981,--配方-稀有生死護腿	71
			551982,--配方-稀有補給頭盔	71
			551983,--配方-稀有補給戰甲	71
			551984,--配方-稀有補給褲子	71
			551985,--配方-稀有神使皮帽	71
			551986,--配方-稀有神使皮衣	71
			551987,--配方-稀有神使皮褲	71
			552154,--配方-稀有永凍頭盔	76
			552155,--配方-稀有永凍鎧甲	76
			552156,--配方-稀有夜幕腿甲	76
			552157,--配方-稀有夜暮護盔	76
			552158,--配方-稀有夜幕輕甲	76
			552159,--配方-稀有夜幕腿甲	76
			552160,--配方-稀有低喃面甲	76
			552161,--配方-稀有低喃皮甲	76
			552162,--配方-稀有低喃護腿	76
			552233 ,--	配方-稀有黃金鎧甲鎧手	製甲	79
			552234 ,--	配方-稀有黃金鎧甲鎧褲	製甲	80
			552235 ,--	配方-稀有黃金鎧甲腰帶	製甲	79
			552237 ,--	配方-稀有赤紅鎖穗手套	製甲	79
			552238 ,--	配方-稀有赤紅鎖穗之褲	製甲	80
			552239 ,--	配方-稀有赤紅鎖穗腰帶	製甲	79
			552241 ,--	配方-稀有叢林探索手套	製甲	79
			552242 ,--	配方-稀有叢林探索長褲	製甲	80
			552243 ,--	配方-稀有叢林探索腰帶	製甲	79
			552291 --	配方-奧義製甲箱	製甲	80
				}
	for i = 1 ,table.getn(Recipe) ,1 do
		AddRecipe( TargetID(), Recipe[i] )
	end
	GetRecipeList(OwnerID(),TargetID())--開啟配方販賣
end
------------------------------------------------------------------------------------------------------------------------------------------------
function Z22_OpenRecipeList_Tailoring_01()--開啟普通級裁縫配方販賣
	CloseSpeak(OwnerID())--關閉對話視窗
	local Recipe={	
			551600,--配方-簡易奧義專家裁縫箱	65
			551734,--配方-簡易精湛工藝裁縫箱	75
			551751,--配方-簡易完美專家裁縫箱	70
			551782,--配方-洞穴頭飾	66
			551783,--配方-洞穴法袍	66
			551784,--配方-洞穴護腿	66
			551785,--配方-喀洛族披風	66
			551921,--配方-聖所頭飾	71
			551922,--配方-聖所法袍	71
			551923,--配方-聖所護腿	71
			551924,--配方-補給披風	71
		 	552111,--配方-海潮頭飾	76
		 	552112,--配方-海潮法袍	76
		 	552113,--配方-海潮長褲	76
		 	552116,--配方-星空披風	76
			552190 ,--	配方-黃金鎧甲披風	裁縫	78
			552194 ,--	配方-赤紅鎖穗披風	裁縫	78
			552198 ,--	配方-叢林探索披風	裁縫	78
			552199 ,--	配方-紫醉金迷手套	裁縫	78
			552200 ,--	配方-紫醉金迷長褲	裁縫	78
			552201 ,--	配方-紫醉金迷腰帶	裁縫	78
			552202 --	配方-紫醉金迷披風	裁縫	78
					}
	for i = 1 ,table.getn(Recipe) ,1 do
		AddRecipe( TargetID(), Recipe[i] )
	end
	GetRecipeList(OwnerID(),TargetID())--開啟配方販賣
end

function Z22_OpenRecipeList_Tailoring_02()--開啟優秀級裁縫配方販賣
	CloseSpeak(OwnerID())--關閉對話視窗
	local Recipe={
			551601,--配方-實用奧義專家裁縫箱	65
			551735,--配方-實用精湛工藝裁縫箱	75
			551752,--配方-實用完美專家裁縫箱	70
			551808,--配方-強化洞穴頭飾	66
			551809,--配方-強化洞穴法袍	66
			551810,--配方-強化洞穴護腿	66
			551811,--配方-強化喀洛族披風	66
			551947,--配方-強化聖所頭飾	71
			551948,--配方-強化聖所法袍	71
			551949,--配方-強化聖所護腿	71
			551950,--配方-強化補給披風	71
		 	552137,--配方-強化海潮頭飾	76
		 	552138,--配方-強化海潮法袍	76
		 	552139,--配方-強化海潮長褲	76
		 	552142,--配方-強化星空披風	76
			552213 ,--	配方-強化黃金鎧甲披風	裁縫	79
			552217 ,--	配方-強化赤紅鎖穗披風	裁縫	79
			552221 ,--	配方-強化叢林探索披風	裁縫	79
			552222 ,--	配方-強化紫醉金迷手套	裁縫	78
			552223 ,--	配方-強化紫醉金迷長褲	裁縫	79
			552224 ,--	配方-強化紫醉金迷腰帶	裁縫	78
			552225 --	配方-強化紫醉金迷披風	裁縫	79
					}
	for i = 1 ,table.getn(Recipe) ,1 do
		AddRecipe( TargetID(), Recipe[i] )
	end
	GetRecipeList(OwnerID(),TargetID())--開啟配方販賣
end

function Z22_OpenRecipeList_Tailoring_03()--開啟精良級裁縫配方販賣
	CloseSpeak(OwnerID())--關閉對話視窗
	local Recipe={
			551602,--配方-精緻奧義專家裁縫箱	65
			551736,--配方-精緻精湛工藝裁縫箱	75
			551753,--配方-精緻完美專家裁縫箱	70
			551834,--配方-稀有洞穴頭飾	66
			551835,--配方-稀有洞穴法袍	66
			551836,--配方-稀有洞穴護腿	66
			551837,--配方-稀有喀洛族披風	66
			551988,--配方-稀有聖所頭飾	71
			551989,--配方-稀有聖所法袍	71
			551990,--配方-稀有聖所護腿	71
			551991,--配方-稀有補給披風	71
			552163,--配方-稀有海潮頭飾	76
			552164,--配方-稀有海潮法袍	76
			552165,--配方-稀有海潮長褲	76
			552168,--配方-稀有星空披風	76
			552236,--配方-稀有黃金鎧甲披風	裁縫	80
			552240,--配方-稀有赤紅鎖穗披風	裁縫	80
			552244,--配方-稀有叢林探索披風	裁縫	80
			552245,--配方-稀有紫醉金迷手套	裁縫	79
			552246,--配方-稀有紫醉金迷長褲	裁縫	80
			552247,--配方-稀有紫醉金迷腰帶	裁縫	79
			552248,--配方-稀有紫醉金迷披風	裁縫	80
			552292--配方-奧義裁縫箱	裁縫	80
				}
	for i = 1 ,table.getn(Recipe) ,1 do
		AddRecipe( TargetID(), Recipe[i] )
	end
	GetRecipeList(OwnerID(),TargetID())--開啟配方販賣
end
------------------------------------------------------------------------------------------------------------------------------------------------
function Z22_OpenRecipeList_Carpentry_01()--開啟普通級木工配方販賣
	CloseSpeak(OwnerID())--關閉對話視窗
	local Recipe={
			551190,--配方-簡易精湛工藝木材箱	75
			551580,--配方-簡易奧義專家木材箱	65
			551745,--配方-簡易完美專家木材箱	70
			551794,--配方-反叛之弓	66
			551795,--配方-回歸之杖	66
			551796,--配方-兇惡之弩	66
			551797,--配方-兇惡權杖	66
			551798,--配方-先祖之靈	66
			551933,--配方-神使之弓	71
			551934,--配方-神使之杖	71
			551935,--配方-聖所之弩	71
			551936,--配方-聖所權杖	71
			551937,--配方-神使法器	71
			552115,--配方-喚靈之石	76
			552123,--配方-雙翼長弓	76
			552125,--配方-輝煌之杖	76
			552126,--配方-誅心連弩	76
			552127,--配方-眾星權杖	76
			552183 ,--	配方-旖角弓	木工	78
			552185 ,--	配方-灰翼權杖	木工	78
			552186 --	配方-光芒之杖	木工	78
			}
	for i = 1 ,table.getn(Recipe) ,1 do
		AddRecipe( TargetID(), Recipe[i] )
	end
	GetRecipeList(OwnerID(),TargetID())--開啟配方販賣
end

function Z22_OpenRecipeList_Carpentry_02()--開啟優秀級木工配方販賣
	CloseSpeak(OwnerID())--關閉對話視窗
	local Recipe={
			551223,--配方-實用精湛工藝木材箱	75
			551581,--配方-實用奧義專家木材箱	65
			551746,--配方-實用完美專家木材箱	70
			551820,--配方-強化反叛之弓	66
			551821,--配方-強化回歸之杖	66
			551822,--配方-強化兇惡之弩	66
			551823,--配方-強化兇惡權杖	66
			551824,--配方-強化先祖之靈	66
			551959,--配方-強化神使之弓	71
			551960,--配方-強化神使之杖	71
			551961,--配方-強化聖所之弩	71
			551962,--配方-強化聖所權杖	71
			551963,--配方-強化神使法器	71
			552141,--配方-強化喚靈之石	76
			552149,--配方-強化雙翼長弓	76
			552151,--配方-強化輝煌之杖	76
			552152,--配方-強化誅心連弩	76
			552153,--配方-強化眾星權杖	76
			552206 ,--	配方-強化旖角弓	木工	79
			552208 ,--	配方-強化灰翼權杖	木工	78
			552209 --	配方-強化光芒之杖	木工	79
				}

	for i = 1 ,table.getn(Recipe) ,1 do
		AddRecipe( TargetID(), Recipe[i] )
	end
	GetRecipeList(OwnerID(),TargetID())--開啟配方販賣
end

function Z22_OpenRecipeList_Carpentry_03()--開啟精良級木工配方販賣
	CloseSpeak(OwnerID())--關閉對話視窗
	local Recipe={
			551224,--配方-精緻精湛工藝木材箱	75
			551582,--配方-精緻奧義專家木材箱	65
			551747,--配方-精緻完美專家木材箱	70
			551846,--配方-稀有反叛之弓	66
			551847,--配方-稀有回歸之杖	66
			551848,--配方-稀有兇惡之弩	66
			551849,--配方-稀有兇惡權杖	66
			551850,--配方-稀有先祖之靈	66
			552000,--配方-稀有神使之弓	71
			552001,--配方-稀有神使之杖	71
			552002,--配方-稀有聖所之弩	71
			552003,--配方-稀有聖所權杖	71
			552004,--配方-稀有神使法器	71
			552167,--配方-稀有喚靈之石	76
			552175,--配方-稀有雙翼長弓	76
			552177,--配方-稀有輝煌之杖	76
			552178,--配方-稀有誅心連弩	76
			552179,--配方-稀有眾星權杖	76
			552229 ,--	配方-稀有旖角弓	木工	80
			552231 ,--	配方-稀有灰翼權杖	木工	79
			552232 ,--	配方-稀有光芒之杖	木工	80
			552290 --	配方-奧義木材箱	木工	80
				}
	for i = 1 ,table.getn(Recipe) ,1 do
		AddRecipe( TargetID(), Recipe[i] )
	end
	GetRecipeList(OwnerID(),TargetID())--開啟配方販賣
end
------------------------------------------------------------------------------------------------------------------------------------------------
function Z22_SkillMaster01()
	local Obj = OwnerID()
	local Target = TargetID()
	local PID = ReadRoleValue(Target,EM_RoleValue_PID)
	local SkillArray={	[15]=EM_RoleValue_SkillMax_BlackSmith,[16]=EM_RoleValue_Skill_Carpenter,[17]=EM_RoleValue_Skill_MakeArmor,
			[18]=EM_RoleValue_Skill_Tailor,[19]=EM_RoleValue_Skill_Cook,[20]=EM_RoleValue_Skill_Alchemy,
			[21]=EM_RoleValue_SkillMax_Mining,[22]=EM_RoleValue_SkillMax_Lumbering,[23]=EM_RoleValue_SkillMax_Herblism}
	local SkillType = math.floor(PID/100)
	LoadQuestOption(Obj)
	if ReadRoleValue(Obj,SkillArray[SkillType])~=0 then
	AddSpeakOption(Obj,Target,"[SC_LIVESKILL_WANTLVUP]","DW_LiveSkill_WantLvUp", 0 )--我想請你提升我的生活技能資格。
	AddSpeakOption(Obj,Target,"[SC_LIVESKILL_WANTLVDOWN]","DW_LiveSkill_WantLvDown", 0 )--我想放棄這種生活技能目前的資格
	else
	AddSpeakOption(Obj,Target,"[SC_LIVESKILL_GETFIRST]","DW_LiveSkill_LvUP", 0 )--我想跟你學習這種生活技能。
	end
end
------------------------------------------------------------------------------------------------------------------------------------------------