function LuaI_242113() --7¤Ñ¾Ô°¨§¤ÃM¥]
	local itemset  = {
		2000	, ""	, { 202450 , 1 } ,	--7¤Ñ¶Â¦â¾Ô°¨§¤ÃM
		4000	, ""	, { 202451 , 1 } ,	--7¤Ñ¥Õ¦â¾Ô°¨§¤ÃM
		6000	, ""	, { 206352 , 1 } ,	--7¤Ñ²öº¸¾Ô°¨§¤ÃM
		8000	, ""	, { 206357 , 1 } ,	--7¤Ñ·´·À¾Ô°¨§¤ÃM
		10000	, ""	, { 240928 , 1 }	}	--7¤Ñ¬y¤õÅ]°¨§¤ÃM
	return BaseTressureProc4( itemset , 1 )
end

function LuaI_242114() --7¤ÑÅbÀk§¤ÃM¥]
	local itemset  = {
		2000	, ""	, { 202231 , 1 } ,	--7¤ÑÅbÀk§¤ÃM
		4000	, ""	, { 202472 , 1 } ,	--7¤Ñ¤õÅbÀk§¤ÃM
		6000	, ""	, { 202473 , 1 } ,	--7¤Ñ¦åÅbÀk§¤ÃM
		8000	, ""	, { 202474 , 1 } ,	--7¤Ñª÷¦âÅbÀk§¤ÃM
		10000	, ""	, { 208695 , 1 }	}	--7¤Ñµµ¾yÅb¾m§¤ÃM
	return BaseTressureProc4( itemset , 1 )
end

function LuaI_242115() --7¤Ñ©Þ©¿§¤ÃM¥]
	local itemset  = {
		2000	, ""	, { 202230 , 1 } ,	--7¤Ñ³·®ü©Þ©¿§¤ÃM
		4000	, ""	, { 202475 , 1 } ,	--7¤Ñ»É¥Ò©Þ©¿§¤ÃM
		6000	, ""	, { 202476 , 1 } ,	--7¤Ñ«C¥Ò©Þ©¿§¤ÃM
		8000	, ""	, { 202477 , 1 } ,	--7¤Ñ¨ª¥Ò©Þ©¿§¤ÃM
		10000	, ""	, { 202478 , 1 }	}	--7¤Ñ¤õ²´©Þ©¿§¤ÃM
	return BaseTressureProc4( itemset , 1 )
end

function LuaI_242116() --7¤Ñ³¥½Þ§¤ÃM¥] I
	local itemset  = {
		2000	, ""	, { 204293 , 1 } ,	--7¤Ñ³¥½Þ§¤ÃM
		4000	, ""	, { 204931 , 1 } ,	--7¤ÑµµÃO³¥½Þ§¤ÃM
		6000	, ""	, { 204934 , 1 } ,	--7¤Ñ¬õÃO³¥½Þ§¤ÃM
		8000	, ""	, { 204937 , 1 } ,	--7¤Ñª÷ÃO³¥½Þ§¤ÃM
		10000	, ""	, { 204940 , 1 }	}	--7¤Ñ¦B­ì³¥½Þ§¤ÃM
	return BaseTressureProc4( itemset , 1 )
end

function LuaI_242117() --7¤Ñ³¥½Þ§¤ÃM¥] II
	local itemset  = {
		2000	, ""	, { 204943 , 1 } ,	--7¤Ñ·¥¦a³¥½Þ§¤ÃM
		4000	, ""	, { 204946 , 1 } ,	--7¤Ñªá´³³¥½Þ§¤ÃM
		6000	, ""	, { 204952 , 1 } ,	--7¤Ñ´³¯¾³¥½Þ§¤ÃM
		8000	, ""	, { 204955 , 1 } ,	--7¤Ñ¨ªµK³¥½Þ§¤ÃM
		10000	, ""	, { 204958 , 1 }	}	--7¤Ñ¶ÀÃO³¥½Þ§¤ÃM
	return BaseTressureProc4( itemset , 1 )
end

function LuaI_242118() --20¤Ñ¦Ï¾m§¤ÃM¥]
	local itemset  = {
		5000	, ""	, { 242153 , 1 } ,	--20¤Ñ³·¦a¦Ï¾m§¤ÃM
		10000	, ""	, { 242154 , 1 }	}	--20¤Ñ¥jªL¦Ï¾m§¤ÃM

	return BaseTressureProc4( itemset , 1 )
end

function LuaI_242119() --20¤Ñ°\§¤ÃM¥]
	local itemset  = {
		5000	, ""	, { 242151 , 1 } ,	--20¤Ñ»A¦Ð¶³°\§¤ÃM
		10000	, ""	, { 242152 , 1 }	}	--20¤ÑµØ¹¢«Õ¼v°\§¤ÃM
	return BaseTressureProc4( itemset , 1 )
end

function LuaI_242120() --20¤ÑÅK¯áÀs§¤ÃM¥]
	local itemset  = {
		5000	, ""	, { 242155 , 1 } ,	--20¤Ñ¨ª«ãÅK¯áÀs§¤ÃM
		10000	, ""	, { 242156 , 1 }	}	--20¤ÑÅQ¤ýÅK¯áÀs§¤ÃM

	return BaseTressureProc4( itemset , 1 )
end

function LuaI_242121() --20¤Ñ³·¶I§¤ÃM¥]
	local itemset  = {
		5000	, ""	, { 242149 , 1 } ,	--20¤ÑÀÆ¥ú³·¶I§¤ÃM
		10000	, ""	, { 242150 , 1 }	}	--20¤Ñ¤Û¼v³·¶I§¤ÃM
	return BaseTressureProc4( itemset , 1 )
end